# SilhouetteEdgesGStyleId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayModel..::..SilhouetteEdgesGStyleId Property
ViewDisplayModel Class See Also
---
Style ID for silhouette edges
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId SilhouetteEdgesGStyleId { get; set; }
```

Visual Basic
---
```text
Public Property SilhouetteEdgesGStyleId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ SilhouetteEdgesGStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ViewDisplayModel Class
Autodesk.Revit.DB Namespace